In [1]:
import pandas as pd

"pandas" 라는 모듈을 pd로 호출하여 사용

In [2]:
dates = pd.date_range('20190301',periods = 6)

dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

"2019-03-01"부터 6일간을 변수 dates에 저장한거
pandas의 data_range 사용(달마다 30,31,28일 계산 불필요)

In [4]:
import numpy as np
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = ['A','B','C','D'])
df

                   A         B         C         D
2019-03-01 -1.653057 -0.107384 -1.256423  0.143578
2019-03-02 -1.407586  1.484310 -0.158549  0.687374
2019-03-03  0.354450 -0.647333 -1.006395 -1.116584
2019-03-04  2.024955 -0.438348  1.098212 -1.670051
2019-03-05  1.873355  0.263467  0.073002  0.788109
2019-03-06 -1.544126 -0.077371  1.131141 -0.509226

numpy라는 수치 연산 관련 모듈을 np에 저장

In [5]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [8]:
df.index

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.values

array([[-1.65305679, -0.107384  , -1.25642284,  0.1435776 ],
       [-1.40758635,  1.48431019, -0.15854886,  0.68737429],
       [ 0.35444958, -0.64733333, -1.00639515, -1.11658381],
       [ 2.02495523, -0.43834811,  1.09821176, -1.67005095],
       [ 1.87335545,  0.26346729,  0.07300248,  0.78810895],
       [-1.544126  , -0.07737109,  1.13114103, -0.50922594]])

In [11]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.058668  0.079557 -0.019835 -0.279467
std    1.721227  0.756746  1.010454  0.994057
min   -1.653057 -0.647333 -1.256423 -1.670051
25%   -1.509991 -0.355607 -0.794434 -0.964744
50%   -0.526568 -0.092378 -0.042773 -0.182824
75%    1.493629  0.178258  0.841909  0.551425
max    2.024955  1.484310  1.131141  0.788109

In [12]:
df.sort_values(by='A')

                   A         B         C         D
2019-03-01 -1.653057 -0.107384 -1.256423  0.143578
2019-03-06 -1.544126 -0.077371  1.131141 -0.509226
2019-03-02 -1.407586  1.484310 -0.158549  0.687374
2019-03-03  0.354450 -0.647333 -1.006395 -1.116584
2019-03-05  1.873355  0.263467  0.073002  0.788109
2019-03-04  2.024955 -0.438348  1.098212 -1.670051

In [14]:
df.sort_values(by='A', ascending=False)

                   A         B         C         D
2019-03-04  2.024955 -0.438348  1.098212 -1.670051
2019-03-05  1.873355  0.263467  0.073002  0.788109
2019-03-03  0.354450 -0.647333 -1.006395 -1.116584
2019-03-02 -1.407586  1.484310 -0.158549  0.687374
2019-03-06 -1.544126 -0.077371  1.131141 -0.509226
2019-03-01 -1.653057 -0.107384 -1.256423  0.143578

In [15]:
df['A']

2019-03-01   -1.653057
2019-03-02   -1.407586
2019-03-03    0.354450
2019-03-04    2.024955
2019-03-05    1.873355
2019-03-06   -1.544126
Freq: D, Name: A, dtype: float64

In [16]:
type(df['A'])

pandas.core.series.Series

In [17]:
df[0:3]

                   A         B         C         D
2019-03-01 -1.653057 -0.107384 -1.256423  0.143578
2019-03-02 -1.407586  1.484310 -0.158549  0.687374
2019-03-03  0.354450 -0.647333 -1.006395 -1.116584

In [18]:
df.loc['2019-03-01']

A   -1.653057
B   -0.107384
C   -1.256423
D    0.143578
Name: 2019-03-01 00:00:00, dtype: float64

In [19]:
df.loc['2019-03-01',['A']]

A   -1.653057
Name: 2019-03-01 00:00:00, dtype: float64

In [20]:
df.loc['2019-03-01',['A','B']]

A   -1.653057
B   -0.107384
Name: 2019-03-01 00:00:00, dtype: float64

In [21]:
df.loc['2019-03-01' : '2019-03-02' , ['A' , 'B']]

                   A         B
2019-03-01 -1.653057 -0.107384
2019-03-02 -1.407586  1.484310

In [22]:
df.loc[: , ['A' , 'B']]

                   A         B
2019-03-01 -1.653057 -0.107384
2019-03-02 -1.407586  1.484310
2019-03-03  0.354450 -0.647333
2019-03-04  2.024955 -0.438348
2019-03-05  1.873355  0.263467
2019-03-06 -1.544126 -0.077371

In [23]:
df.iloc[0 : 2]

                   A         B         C         D
2019-03-01 -1.653057 -0.107384 -1.256423  0.143578
2019-03-02 -1.407586  1.484310 -0.158549  0.687374

In [24]:
df.iloc[0 : 2, 0 : 2]

                   A         B
2019-03-01 -1.653057 -0.107384
2019-03-02 -1.407586  1.484310

In [25]:
df.iloc[[0,1,3] , 0 : 2]

                   A         B
2019-03-01 -1.653057 -0.107384
2019-03-02 -1.407586  1.484310
2019-03-04  2.024955 -0.438348

In [26]:
df.iloc[[0 , 1 , 3]]

                   A         B         C         D
2019-03-01 -1.653057 -0.107384 -1.256423  0.143578
2019-03-02 -1.407586  1.484310 -0.158549  0.687374
2019-03-04  2.024955 -0.438348  1.098212 -1.670051

In [27]:
df['A'] > 0

2019-03-01    False
2019-03-02    False
2019-03-03     True
2019-03-04     True
2019-03-05     True
2019-03-06    False
Freq: D, Name: A, dtype: bool

In [28]:
df['A']>0

2019-03-01    False
2019-03-02    False
2019-03-03     True
2019-03-04     True
2019-03-05     True
2019-03-06    False
Freq: D, Name: A, dtype: bool

In [29]:
df[df['A'] > 0]

                   A         B         C         D
2019-03-03  0.354450 -0.647333 -1.006395 -1.116584
2019-03-04  2.024955 -0.438348  1.098212 -1.670051
2019-03-05  1.873355  0.263467  0.073002  0.788109

In [30]:
df > 0

                A      B      C      D
2019-03-01  False  False  False   True
2019-03-02  False   True  False   True
2019-03-03   True  False  False  False
2019-03-04   True  False   True  False
2019-03-05   True   True   True   True
2019-03-06  False  False   True  False

In [31]:
df[df > 0]

                   A         B         C         D
2019-03-01       NaN       NaN       NaN  0.143578
2019-03-02       NaN  1.484310       NaN  0.687374
2019-03-03  0.354450       NaN       NaN       NaN
2019-03-04  2.024955       NaN  1.098212       NaN
2019-03-05  1.873355  0.263467  0.073002  0.788109
2019-03-06       NaN       NaN  1.131141       NaN

In [32]:
df2 = pd.DataFrame(df, columns = ['A' , 'C' , 'D' , 'B'])
df2

                   A         C         D         B
2019-03-01 -1.653057 -1.256423  0.143578 -0.107384
2019-03-02 -1.407586 -0.158549  0.687374  1.484310
2019-03-03  0.354450 -1.006395 -1.116584 -0.647333
2019-03-04  2.024955  1.098212 -1.670051 -0.438348
2019-03-05  1.873355  0.073002  0.788109  0.263467
2019-03-06 -1.544126  1.131141 -0.509226 -0.077371

In [33]:
df['E'] = np.nan
df

                   A         B         C         D   E
2019-03-01 -1.653057 -0.107384 -1.256423  0.143578 NaN
2019-03-02 -1.407586  1.484310 -0.158549  0.687374 NaN
2019-03-03  0.354450 -0.647333 -1.006395 -1.116584 NaN
2019-03-04  2.024955 -0.438348  1.098212 -1.670051 NaN
2019-03-05  1.873355  0.263467  0.073002  0.788109 NaN
2019-03-06 -1.544126 -0.077371  1.131141 -0.509226 NaN

In [34]:
df.loc['2019-03-02' , ['E']] = 2
df

                   A         B         C         D    E
2019-03-01 -1.653057 -0.107384 -1.256423  0.143578  NaN
2019-03-02 -1.407586  1.484310 -0.158549  0.687374  2.0
2019-03-03  0.354450 -0.647333 -1.006395 -1.116584  NaN
2019-03-04  2.024955 -0.438348  1.098212 -1.670051  NaN
2019-03-05  1.873355  0.263467  0.073002  0.788109  NaN
2019-03-06 -1.544126 -0.077371  1.131141 -0.509226  NaN

In [35]:
df['F'] = df['A'] + df['B']
df

                   A         B         C         D    E         F
2019-03-01 -1.653057 -0.107384 -1.256423  0.143578  NaN -1.760441
2019-03-02 -1.407586  1.484310 -0.158549  0.687374  2.0  0.076724
2019-03-03  0.354450 -0.647333 -1.006395 -1.116584  NaN -0.292884
2019-03-04  2.024955 -0.438348  1.098212 -1.670051  NaN  1.586607
2019-03-05  1.873355  0.263467  0.073002  0.788109  NaN  2.136823
2019-03-06 -1.544126 -0.077371  1.131141 -0.509226  NaN -1.621497

In [36]:
pd.read_excel("./data/teenage_mental.xls")

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2018,구분,42.7,34.5,51.5,29.6,24.2,35.4,15.4,11.8,19.2

In [37]:
pd.read_excel("./data/teenage_mental.xls" , header = 1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2018  구분  42.7  34.5  51.5  29.6   24.2   35.4  15.4   11.8   19.2

In [38]:
pd.read_excel("./data/teenage_mental.xls" , header = 1 , usecols = "C : K")

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  42.7  34.5  51.5  29.6   24.2   35.4  15.4   11.8   19.2

In [40]:
col_names = ['스트레스' , '스트레스남학생' , '스트레스여학생' , '우울감경험률' , 
            '우울남학생' , '우울여학생' , '자살생각율' , '자살남학생' , '자살여학생']
pd.read_excel("./data/teenage_mental.xls" , header = 1 , usecols = "C : K" , names = col_names)

   스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2

In [42]:
raw_data = pd.read_excel("./data/teenage_mental.xls" , 
                         header = 1 , 
                         usecols = "C : K" , 
                         names = col_names)
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2

In [43]:
raw_data.loc[1] = 100. - raw_data.loc[0]
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2
1  57.3     65.5     48.5    70.4   75.8   64.6   84.6   88.2   80.8

In [44]:
raw_data['응답'] = ['그렇다' , '아니다']
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생   응답
0  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2  그렇다
1  57.3     65.5     48.5    70.4   75.8   64.6   84.6   88.2   80.8  아니다

In [45]:
raw_data.set_index('응답' , drop = True , inplace = True)
raw_data

     스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
응답
그렇다  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2
아니다  57.3     65.5     48.5    70.4   75.8   64.6   84.6   88.2   80.8

In [46]:
import pandas as pd

col_names = ['스트레스','스트레스남학생','스트레스여학생','우울감경험률',
            '우울남학생','우울여학생','자살생각율','자살남학생','자살여학생']
raw_data = pd.read_excel("./data/teenage_mental.xls",
                        header = 1,
                        usecols = 'C:K',
                        names = col_names)
raw_data.loc[1] = 100. - raw_data.loc[0]
raw_data['응답'] = ['그렇다','아니다']
raw_data.set_index('응답', drop = True , inplace = True)

raw_data

     스트레스  스트레스남학생  스트레스여학생  우울감경험률  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
응답
그렇다  42.7     34.5     51.5    29.6   24.2   35.4   15.4   11.8   19.2
아니다  57.3     65.5     48.5    70.4   75.8   64.6   84.6   88.2   80.8